// 1. გვაქვს name; age; დაბეჭდე "მე ვარ" (name) "წლის ... (age)"

// 2. მოცემულია რადიუსი 10, გამოვთვალოთ სფეროს  მოცემულობა. ფორმულა 4/3*პი*რადიუსის კუბზე

//3. რას დაბეჭდავს მოცემული ცვლადი: 
let x = 5;
{
    let x = 10;
    {
        x = x + 2;
        console.log(x);
    }
} 
console.log(x);

// 4. მოცემულია საქონლის ფასი, 
// თუ საქონლის ფასი 100-ზე მეტია, უნდა შევამციროდ 20 % ით, 
// თუ ლუწია, შევამციროთ 10 % ით,
// თუ ორივეა, შევამციროთ 15 % ით

// 5. რისი ტოლია მოცემული გამოსახულება:
// 5 > 2 && 7 < 3 || 2 > 1   
// 5 < 2 && 7 < 3 || 2 > 1  
// 5 < 2 && (7 < 3 || 2 > 1) 
// 5 > 2 && (7 < 3 || 2 > 1) 
// 5 > -2 < -1     
// !!!!!(5 > -2 < -1) 

//6. რომელი მნიშვნელობები არის false ტოლფასი?
// -2, 0, 1, 5, "", "0", "1", null

//7. რას შვრება typeof?  
// რას დაბეჭდავს შემდეგი კოდი: typeof typeof []; 
// რას დაბეჭდავს შემდეგი კოდი:
if(k<5){
    console.log('yes');  
}else{
    console.log('no');  
}
// რას დაბეჭდავს შემდეგი კოდი:
if(typeof k !=='undefined' && k > 5){ 
    console.log('yes');
}else{
    console.log('no');  
}

//8. დაბეჭდე 1 დან 6 მდე ჯამი for loop 

//9. დაბეჭდე 6 ზე ნაკლები ფიბონაჩის რიცხვები

//10. დაბეჭდე მე-n-ე ფიბონაჩის წევრი
let a1 = 0;
let a2 = 1;
let n = 10;

//11. მასივის კენტ რიცხვთა ჯამი

//12. ორი მასივის თანაკვეთა

// 13 იპოვეთ მატრიცის ყველა წევრის ჯამი
let matrix = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9] 
]

// 14  დაწერეთ ფუნქცია, რომელსაც არგუმენტად გადაეცემა c ფუნქცია. 
// ამ ფუნქციამ რენდომად უნდა აიღოს 1-დან 10-მდე მთელი რიცხი და გადასცეს c ფუნქციას და გამოიძახოს იგი
// 15. დაწერეთ ფუქცია, რომელიც გამოთვლის n-ის ფაქტორიალს
//16. 14 და 15 ამოცანების საშუალებით გამოთვალეთ რენდომ რიცხვის ფაქტორიალი

//17.
function a(c1, c2, t){ // b, k, 10
    console.log(1);
    c1(c2, t);
}

function b(c1, p) { // k, 10
    console.log(2);
    c1(p);
}

function k(n) { // 10
    console.log(3);
    console.log(n * n);
}

a(b, k, 10);
//რას დაბეჭდავს

//18. 
leptops = [
    {brand: 'samsung', price: 1200, series: ['a-10', 'a-12', 'a-18']},
    {brand: 'lg', price: 900, series: ['b-15', 'b-19']}, 
    {brand: 'hp', price: 1100, series: ['c-20', 'c-23', 'c-17', 'c-10']}, 
];

//19. დაწერეთ ფუნქცია, რომელიც დააბრუნებს ყველა იმ ელემენტს, რომლის ფასიც რაღაც  price რიცხვზე მეტია

//20. დაწერეთ ფუნქცია, რომელიც დააბრუნებს ელემენტების ბრენდების მასივს

//21. დაწერეთ ფუნქცია, რომელიც დააბრუნებს ახალი ელემენტების მასივს, 
//სადაც ყველა ელემენტის ფასი percent პროცენტით არის გაზრდილი

//22. დაალაგეთ ელემენტების ფასის კლებადობის მიხედვით

//23. დაწერეთ ფუნქცია, რომელიც დააბრუნებს ყველა ელემენტების სერიების გაერთიანებას მასივის სახით.
